### **24 - Cambiar el tipo de dato de una columna de un Dataframe**

In [1]:
import pandas as pd
import numpy as np

#### **`>` apply( )**

In [ ]:
df = pd.read_csv('flights.csv')
df

##### Ejemplo 1

In [ ]:
dp = pd.read_csv('datos_persona.csv')
dp

In [ ]:
dp.dtypes

indice      int64
sexo       object
altura    float64
peso        int64
nombre     object
dtype: object

In [21]:
def entero(a):
    return int(a)

In [22]:
dp['altura'] = dp['altura'].apply(entero)

dp

   indice sexo  altura  peso     nombre
0       0    F       1    68    Javiera
1       1    M       1    43       Jose
2       2    M       1    90      Tomas
3       3    F       1    95      Maria
4       4    M       2   100       Jose
5       5    F       1    50  Magdalena
6       6    F       1    67   Trinidad
7       7    M       1   102    Gonzalo
8       8    M       1    76      David
9       9    M       1    68     Javier

In [26]:
dp.dtypes

indice     int64
sexo      object
altura     int64
peso       int64
nombre    object
dtype: object

##### Ejemplo 2

Obtenemos lo mismo utilizando una funci√≥n lambda directamente en el metodo **`apply()`**

In [2]:
dp = pd.read_csv('datos_persona.csv')

In [3]:
dp.dtypes

indice      int64
sexo       object
altura    float64
peso        int64
nombre     object
dtype: object

In [4]:
dp['altura'] = dp['altura'].apply(lambda a:int(a))

dp

   indice sexo  altura  peso     nombre
0       0    F       1    68    Javiera
1       1    M       1    43       Jose
2       2    M       1    90      Tomas
3       3    F       1    95      Maria
4       4    M       2   100       Jose
5       5    F       1    50  Magdalena
6       6    F       1    67   Trinidad
7       7    M       1   102    Gonzalo
8       8    M       1    76      David
9       9    M       1    68     Javier

In [5]:
dp.dtypes

indice     int64
sexo      object
altura     int64
peso       int64
nombre    object
dtype: object